import React from "react";
const AboutUs = () => {
  return (
    <section className="about-us">
      <h2 className="about-title">Про нас</h2>
      <p className="about-text">
        Наша історія — це історія двох сердець, які зустрілись у потрібний момент. Від перших поглядів до довгих розмов, від подорожей до мрій — усе вело нас до цього особливого дня.
      </p>
      <p className="about-text">
        Разом ми навчилися бути підтримкою, радістю та спокоєм один для одного. Любов, яка зростала з кожним днем, стала міцною основою нашої майбутньої сім’ї.
      </p>
      <p className="about-text">
        Ми щиро віримо, що справжнє щастя — це розділяти життя з тим, кого любиш. І з великою радістю ділимося цим щастям з вами!
      </p>
      <p className="about-names">💗 Владислав & Анастасія 💗</p>

    </section>
  );
};

export default AboutUs;
