import { useAppSelector } from "../../hooks/hooks";

type Props = {}

const MainInfo = (props: Props) => {
  const { me } = useAppSelector((state) => state.auth);
  if (!me) return null;

  return (
    <section className="main-info">

      <p className="main-text">
        Ми щасливі, що ви розділите з нами особливий день — наше весілля, яке відбудеться 3 липня 2025 року у Варшаві!
      </p>

      <p className="main-text">
        Щоб усе пройшло легко і приємно, ділимося з вами ключовою інформацією:
      </p>

      <hr />

      <h3>📍 Церемонія та святкування</h3>
      <p><strong>Локація:</strong><br />
        Ресторан Dwor Złotopolska Dolina<br />
        Адреса: Trębki Nowe 89, 05-170</p>

      <p><strong>Програма дня:</strong></p>
      <ul>
        <li>07:00–9:00 — Сніданок у готелі</li>
        <li>10:30 — Трансфер з готелю</li>
        <li>12:00 — Вінчання в церкві Успіння Пресвятої Богородиці</li>
        <li>13:00 — Трансфер до ресторану</li>
        <li>15:00 — Аперитив із шампанським та закусками</li>
        <li>16:00 — Урочиста церемонія</li>
        <li>17:00 — Святковий банкет</li>
      </ul>

      <hr />

      <h3>🏨 Проживання</h3>
      <p>🛎️ Заселення — ви зможете заселитися, назвавши своє прізвище на рецепції.</p>
      <p>
        Якщо ви плануєте приїхати раніше, будемо раді зустрітись із вами на затишній вечері 2 липня о 19:00 в готелі — це наш маленький подарунок для вас ❤️
      </p>
      <p>Проживання в ніч після весілля (з 3 на 4 липня) вже включене з нашого боку.</p>

      <hr />

      <h3>🍷 Замість квітів та алкоголю</h3>
      <p>
        У зв’язку з нашою дорогою після весілля, ми щиро просимо не дарувати квітів та алкоголю.
      </p>
      <p>
        Просто приходьте з гарним настроєм та бажанням святкувати з нами — це саме те, що нам найбільше потрібно! ❤️
      </p>

      <hr />

      <h3>🏊 After-party: Relax & Splash</h3>
      <p>
        Після офіційної частини й танців до пізньої ночі планується нічне купання в басейні на території комплексу.
      </p>
      <p>
        Будь ласка, не забудьте взяти купальники та плавки, якщо хочете приєднатись до after-party в стилі “relax & splash”! 💦
      </p>

      <hr />

      <p className="couple-names">До зустрічі на святі кохання!<br />
        З любов’ю,<br />
        Владислав та Анастасія 💗</p>
    </section>
  );
};

export default MainInfo;

